       01 BRE-INP-INPUT-STRUCTURE.
         02 BRE-I-BANK-SIGNON-ID PIC X(5).
         02 BRE-I-BANK-USERID PIC X(5).
         02 BRE-I-BANK-PSWD PIC X(8).