       01 BRE-OUT-OUTPUT-STRUCTURE.
         02 BRE-O-WS-INPUT-FLAG PIC X(1).
         02 BRE-O-WS-ERROR-MSG PIC X(75).
         02 BRE-O-BANK-SIGNON-ID PIC X(5).
         02 BRE-O-BANK-USERID PIC X(5).
         02 BRE-O-BANK-USERID-NA PIC X(25).