       01 BRE-INP-INPUT-STRUCTURE.
         02 BRE-I-CD02I-CONTACT PIC X(5).
         02 BRE-I-CD02I-CONTACT0 PIC X(25).
         02 BRE-I-CD02I-CONTACT1 PIC X(25).
         02 BRE-I-CD02I-CONTACT2 PIC X(2).
         02 BRE-I-CD02I-CONTACT3 PIC X(6).
         02 BRE-I-CD02I-CONTACT4 PIC X(6).
         02 BRE-I-CD02I-CONTACT5 PIC X(30).
         02 BRE-I-CD02I-CONTACT6 PIC X(1).
         02 BRE-I-CD02I-CONTACT7 PIC X(1).