       IDENTIFICATION DIVISION.
       PROGRAM-ID. READDRVR.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 BRE-OUT-OUTPUT-STRUCTURE2.
         02 BRE-O-CD02O-DATA.
           03 BRE-O-CD02O-CONTACT PIC X(5).
           03 BRE-O-CD02O-CONTACT0 PIC X(25).
           03 BRE-O-CD02O-CONTACT1 PIC X(25).
           03 BRE-O-CD02O-CONTACT2 PIC X(25).
           03 BRE-O-CD02O-CONTACT3 PIC X(2).
           03 BRE-O-CD02O-CONTACT4 PIC X(6).
           03 BRE-O-CD02O-CONTACT5 PIC X(6).
           03 BRE-O-CD02O-CONTACT6 PIC X(12).
           03 BRE-O-CD02O-CONTACT7 PIC X(30).
           03 BRE-O-CD02O-CONTACT8 PIC X(1).
           03 BRE-O-CD02O-CONTACT9 PIC X(1).
         02 BRE-O-EIBRESP PIC S9(8) USAGE IS BINARY.

       01 HTTP-HEADER   PIC X(13) VALUE 'Authorisation'.
       01 HTTP-HEADER-VALUE   PIC X(64) VALUE SPACES.
       01 HEADER-ACAO.
           02 FILLER      PIC X(16) VALUE 'Access-Control-A'.
           02 FILLER      PIC X(11) VALUE 'llow-Origin'.
       01 HEADER-ACAO-LENGTH PIC S9(08) COMP VALUE 27.
       01 VALUE-ACAO PIC X(01) VALUE '*'.
       01 VALUE-ACAO-LENGTH PIC S9(08) COMP VALUE 01.
       
       LINKAGE SECTION.

       COPY 'READREQ'.
       COPY 'READRESP'.

       PROCEDURE DIVISION.
       000-START-PROCESSING.

           SET ADDRESS OF BRE-INP-INPUT-STRUCTURE
              TO ADDRESS OF DFHCOMMAREA
           
           CALL 'READADDR' USING DFHEIBLK
                                DFHCOMMAREA
                                BRE-INP-INPUT-STRUCTURE
                                BRE-OUT-OUTPUT-STRUCTURE2 

           SET ADDRESS OF BRE-OUT-OUTPUT-STRUCTURE
              TO ADDRESS OF DFHCOMMAREA

           MOVE BRE-OUT-OUTPUT-STRUCTURE2 TO BRE-OUT-OUTPUT-STRUCTURE

           EXEC CICS WEB WRITE
              HTTPHEADER (HEADER-ACAO)
              NAMELENGTH (HEADER-ACAO-LENGTH)
              VALUE      (VALUE-ACAO)
              VALUELENGTH (VALUE-ACAO-LENGTH)
              NOHANDLE
           END-EXEC.
           
           EXEC CICS RETURN
           END-EXEC.
